examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu_par/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version          2.0;
    format           ascii;
    class            dictionary;
    location         "constant";
    object           CanteraTorchProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry            off;

CanteraMechanismFile "ES80_H2-7-16.yaml";

transportModel       "UnityLewis";

odeCoeffs
{
    "relTol"         1e-6;
    "absTol"         1e-10;
}

inertSpecie          "N2";

splittingStrategy    off;

TorchSettings
{
    torch            off;
    GPU              off;
    log              off;
    torchModel       "HE04_Hydrogen_ESH2_GMS_sub_20221101"; 
    coresPerNode     4;
}

AmgxSettings
{
    UEqnSettingPath "/root/0822/deepflame-dev/examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu/system/amgxUOptions";
    pEqnSettingPath "/root/0822/deepflame-dev/examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu/system/amgxpOptions";
}

loadbalancing
{
    active           true;
    log              false;
    algorithm        allAverage;//headTail;
}


// ************************************************************************* //
