examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu_par/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4096
(
(0.196034 -0.196034 0)
(0.586215 -0.194146 0)
(0.97075 -0.190389 0)
(1.34594 -0.184798 0)
(1.70816 -0.177427 0)
(2.05393 -0.168347 0)
(2.37993 -0.157646 0)
(2.683 -0.145427 0)
...
)
;

boundaryField
{
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
