examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu_par/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object       O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
4096
(
2.329999897313045e-01
2.329999780008285e-01
2.329999528700103e-01
2.329998990309368e-01
2.329997836886575e-01
2.329995365849148e-01
2.329990072020782e-01
2.329978730799590e-01
...
)
;

boundaryField
{
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
