examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu_par/0/OH
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object       OH;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
4096
(
1.094565520108786e-30
1.602130315701276e-30
2.345124872843328e-30
3.432890461191287e-30
5.025847084044331e-30
7.359989217724817e-30
1.078447780298402e-29
1.582214100859637e-29
...
)
;

boundaryField
{
    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    down
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
