examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu_par/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss linear;
    div(phi,Yi)         Gauss linear;
    div(phi,h)          Gauss linear;
    div(phi,ha)          Gauss linear;
    div(phi,K)          Gauss linear;
    div(phid,p)         Gauss linear;
    div(phi,epsilon)    Gauss linear;
    div(phi,Yi_h)       Gauss upwind;
    div(phi,k)          Gauss linear;
    div(hDiffCorrFlux)             Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}


// ************************************************************************* //
