examples/dfLowMachFoam/threeD_reactingTGV/H2/cvodeIntegrator_gpu_par/system/amgxpOptions
config_version=2
algorithm=AGGREGATION
selector=SIZE_2
cycle=V
smoother=MULTICOLOR_DILU
presweeps=1
postsweeps=1
coarse_solver=NOSOLVER
coarsest_sweeps=2
max_levels=1000
norm=L2
convergence=RELATIVE_INI
max_uncolored_percentage=0.15
max_iters=1000
monitor_residual=1
store_res_history=1
tolerance=1e-5
print_solve_stats=0
print_grid_stats=0
obtain_timings=0

